import { AboutUsCardType } from "../types/AboutUsType";

const aboutUsCards: AboutUsCardType[] = [
  {
    icon: "/aboutUs/settings.svg",
    gradient: ["#8496FF", "#0E28AE"],
    title: "Ми — не агенція. Ми — партнери.",
    subtitle: "🧠 Ми думаємо як бізнес",
    description:
      "Ми не просто виконуємо таски. Ми пропонуємо рішення, що приносять результат. Знаємо, що таке ROI, MVP і коли не треба overengineer-ити.",
  },
  {
    icon: "/aboutUs/clock.svg",
    gradient: ["#B9EDFF", "#2C95E0"],
    title: "Кодуємо швидко, але не тяп-ляп",
    subtitle: "🚀 Швидкий старт",
    description:
      "Ми включаємось у роботу протягом 3 днів після першого дзвінка. Без довгих брифів, без затягувань, без зайвого.",
  },
  {
    icon: "/aboutUs/phone.svg",
    gradient: ["#9BC3FF", "#186AE5"],
    title: "Говоримо просто",
    subtitle: "💬 Без техно-лірики",
    description:
      "Пояснюємо людською мовою, що, як і чому ми робимо. Завжди на зв'язку, працюємо прозоро.",
  },
  {
    icon: "/aboutUs/bulb.svg",
    gradient: ["#D3F9FF", "#31BEDB"],
    title: "Обираємо, що працює",
    subtitle: "🎯 Технології під задачу",
    description:
      "Не нав’язуємо складні рішення, якщо можна просто. Пропонуємо те, що підходить саме твоєму проєкту.",
  },
];

export default aboutUsCards;
